tap 'homebrew/cask'
tap 'caskroom/fonts'
cask 'caskroom/fonts/font-hack'

cask '1password'
cask 'firefox'
cask 'chromium'
cask 'skype'
cask 'slack'
cask 'inkscape'
cask 'zoom'
cask 'spotify'

# Programming Languages & tools
cask 'java'
brew 'gradle'
brew 'nvm'
brew 'leiningen'

# Development Tools
brew 'git'

# Cloud & CI
tap 'heroku/brew'
brew 'heroku'
brew 'awscli'
cask 'docker'
brew 'circleci', args: ["ignore-dependencies"]

# IDEs & Helpers
cask 'intellij-idea-ce'
brew 'emacs'
brew 'multimarkdown'
brew 'shellcheck'
brew 'wakatime-cli'
