tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'

cask 'enpass'
cask 'firefox'
cask 'chromium'
cask 'skype'
cask 'slack'
cask 'inkscape'
cask 'zoom'
cask 'spotify'
cask 'android-file-transfer'
cask 'google-drive'

# Programming Languages & tools
brew 'java'
brew 'gradle'
brew 'nvm'
brew 'leiningen'

# Development Tools
brew 'git'

# Libraries
brew 'openssl'

# Cloud & CI
tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'
brew 'awscli'
cask 'docker'
brew 'circleci', args: ["ignore-dependencies"]
brew 'pulumi'

# IDEs & Helpers
cask 'emacs'
brew 'multimarkdown'
brew 'shellcheck'
